🚀&nbsp; env0 had composed a PR Plan for environment [My First Project / Env0 (env_0test)](https://app.env0.com/p/bf060c70-8f38-400d-906c-f243d9ffdb03/environments/7571e4bf-f6f2-4ed2-8b7f-94f3cfce5f66):
```
Plan: 1 to add, 0 to change, 1 to destroy.
```
<details>
<summary>Plan Details</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
-   destroy

Terraform will perform the following actions:


  # aws_instance.myec2 will be destroyed
  # (because aws_instance.myec2 is not in configuration)
-   resource "aws_instance" "myec2" {
-       ami                                  = "ami-00c39f71452c08778" -> null
-       arn                                  = "arn:aws:ec2:us-east-1:262012066492:instance/i-03507b266cdc34817" -> null
-       associate_public_ip_address          = true -> null
-       availability_zone                    = "us-east-1b" -> null
-       cpu_core_count                       = 1 -> null
-       cpu_threads_per_core                 = 1 -> null
-       disable_api_stop                     = ************* -> null
-       disable_api_termination              = ************* -> null
-       ebs_optimized                        = ************* -> null
-       get_password_data                    = ************* -> null
-       hibernation                          = ************* -> null
-       id                                   = "i-03507b266cdc34817" -> null
-       instance_initiated_shutdown_behavior = "stop" -> null
-       instance_state                       = "running" -> null
-       instance_type                        = "t2.micro" -> null
-       ipv6_address_count                   = 0 -> null
-       ipv6_addresses                       = [] -> null
-       monitoring                           = ************* -> null
-       placement_partition_number           = 0 -> null
-       primary_network_interface_id         = "eni-0aa33502945bf3fe0" -> null
-       private_dns                          = "ip-172-31-30-145.ec2.internal" -> null
-       private_ip                           = "172.31.30.145" -> null
-       public_dns                           = "ec2-54-236-252-42.compute-1.amazonaws.com" -> null
-       public_ip                            = "54.236.252.42" -> null
-       secondary_private_ips                = [] -> null
-       security_groups                      = [
-           "default",
        ] -> null
-       source_dest_check                    = true -> null
-       subnet_id                            = "subnet-07ae4b4fb41e259fa" -> null
-       tags                                 = {} -> null
-       tags_all                             = {} -> null
-       tenancy                              = "default" -> null
-       user_data_replace_on_change          = ************* -> null
-       vpc_security_group_ids               = [
-           "sg-0885f897167dc1dea",
        ] -> null

-       capacity_reservation_specification {
-           capacity_reservation_preference = "open" -> null
        }

-       cpu_options {
-           core_count       = 1 -> null
-           threads_per_core = 1 -> null
        }

-       credit_specification {
-           cpu_credits = "standard" -> null
        }

-       enclave_options {
-           enabled = ************* -> null
        }

-       maintenance_options {
-           auto_recovery = "default" -> null
        }

-       metadata_options {
-           http_endpoint               = "enabled" -> null
-           http_protocol_ipv6          = "disabled" -> null
-           http_put_response_hop_limit = 2 -> null
-           http_tokens                 = "required" -> null
-           instance_metadata_tags      = "disabled" -> null
        }

-       private_dns_name_options {
-           enable_resource_name_dns_a_record    = ************* -> null
-           enable_resource_name_dns_aaaa_record = ************* -> null
-           hostname_type                        = "ip-name" -> null
        }

-       root_block_device {
-           delete_on_termination = true -> null
-           device_name           = "/dev/xvda" -> null
-           encrypted             = ************* -> null
-           iops                  = 3000 -> null
-           tags                  = {} -> null
-           throughput            = 125 -> null
-           volume_id             = "vol-0c06cc4ca22cdf279" -> null
-           volume_size           = 8 -> null
-           volume_type           = "gp3" -> null
        }
    }


  # aws_instance.myec222 will be created
+   resource "aws_instance" "myec222" {
+       ami                                  = "ami-00c39f71452c08778"
+       arn                                  = (known after apply)
+       associate_public_ip_address          = (known after apply)
+       availability_zone                    = (known after apply)
+       cpu_core_count                       = (known after apply)
+       cpu_threads_per_core                 = (known after apply)
+       disable_api_stop                     = (known after apply)
+       disable_api_termination              = (known after apply)
+       ebs_optimized                        = (known after apply)
+       get_password_data                    = *************
+       host_id                              = (known after apply)
+       host_resource_group_arn              = (known after apply)
+       iam_instance_profile                 = (known after apply)
+       id                                   = (known after apply)
+       instance_initiated_shutdown_behavior = (known after apply)
+       instance_lifecycle                   = (known after apply)
+       instance_state                       = (known after apply)
+       instance_type                        = "t2.micro"
+       ipv6_address_count                   = (known after apply)
+       ipv6_addresses                       = (known after apply)
+       key_name                             = (known after apply)
+       monitoring                           = (known after apply)
+       outpost_arn                          = (known after apply)
+       password_data                        = (known after apply)
+       placement_group                      = (known after apply)
+       placement_partition_number           = (known after apply)
+       primary_network_interface_id         = (known after apply)
+       private_dns                          = (known after apply)
+       private_ip                           = (known after apply)
+       public_dns                           = (known after apply)
+       public_ip                            = (known after apply)
+       secondary_private_ips                = (known after apply)
+       security_groups                      = (known after apply)
+       source_dest_check                    = true
+       spot_instance_request_id             = (known after apply)
+       subnet_id                            = (known after apply)
+       tags_all                             = (known after apply)
+       tenancy                              = (known after apply)
+       user_data                            = (known after apply)
+       user_data_base64                     = (known after apply)
+       user_data_replace_on_change          = *************
+       vpc_security_group_ids               = (known after apply)

+       capacity_reservation_specification {
+           capacity_reservation_preference = (known after apply)

+           capacity_reservation_target {
+               capacity_reservation_id                 = (known after apply)
+               capacity_reservation_resource_group_arn = (known after apply)
            }
        }

+       cpu_options {
+           amd_sev_snp      = (known after apply)
+           core_count       = (known after apply)
+           threads_per_core = (known after apply)
        }

+       ebs_block_device {
+           delete_on_termination = (known after apply)
+           device_name           = (known after apply)
+           encrypted             = (known after apply)
+           iops                  = (known after apply)
+           kms_key_id            = (known after apply)
+           snapshot_id           = (known after apply)
+           tags                  = (known after apply)
+           throughput            = (known after apply)
+           volume_id             = (known after apply)
+           volume_size           = (known after apply)
+           volume_type           = (known after apply)
        }

+       enclave_options {
+           enabled = (known after apply)
        }

+       ephemeral_block_device {
+           device_name  = (known after apply)
+           no_device    = (known after apply)
+           virtual_name = (known after apply)
        }

+       instance_market_options {
+           market_type = (known after apply)

+           spot_options {
+               instance_interruption_behavior = (known after apply)
+               max_price                      = (known after apply)
+               spot_instance_type             = (known after apply)
+               valid_until                    = (known after apply)
            }
        }

+       maintenance_options {
+           auto_recovery = (known after apply)
        }

+       metadata_options {
+           http_endpoint               = (known after apply)
+           http_protocol_ipv6          = (known after apply)
+           http_put_response_hop_limit = (known after apply)
+           http_tokens                 = (known after apply)
+           instance_metadata_tags      = (known after apply)
        }

+       network_interface {
+           delete_on_termination = (known after apply)
+           device_index          = (known after apply)
+           network_card_index    = (known after apply)
+           network_interface_id  = (known after apply)
        }

+       private_dns_name_options {
+           enable_resource_name_dns_a_record    = (known after apply)
+           enable_resource_name_dns_aaaa_record = (known after apply)
+           hostname_type                        = (known after apply)
        }

+       root_block_device {
+           delete_on_termination = (known after apply)
+           device_name           = (known after apply)
+           encrypted             = (known after apply)
+           iops                  = (known after apply)
+           kms_key_id            = (known after apply)
+           tags                  = (known after apply)
+           throughput            = (known after apply)
+           volume_id             = (known after apply)
+           volume_size           = (known after apply)
+           volume_type           = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "my_var" but a value was
│ found in file "env0.auto.tfvars.json". If you meant to use this value, add
│ a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
```
</details>


```
Monthly cost change for H3rMajesty/Env0/env0_tf_plan.json
Amount:  +$0.16 ($9 → $9)
Percent: +2%
```
<details>
<summary>Cost Estimation Details</summary>

```diff
──────────────────────────────────
Project: H3rMajesty/Env0/env0_tf_plan.json

- aws_instance.myec2
  -$9

-     Instance usage (Linux/UNIX, on-demand, t2.micro)
      -$8

-     root_block_device
    
-         Storage (general purpose SSD, gp3)
          -$0.64

+ aws_instance.myec222
  +$9

+     Instance usage (Linux/UNIX, on-demand, t2.micro)
      +$8

+     root_block_device
    
+         Storage (general purpose SSD, gp2)
          +$0.80

Monthly cost change for H3rMajesty/Env0/env0_tf_plan.json
Amount:  +$0.16 ($9 → $9)
Percent: +2%

──────────────────────────────────
Key: ~ changed, + added, - removed

1 cloud resource was detected:
∙ 1 was estimated, it includes usage-based costs, see https://infracost.io/usage-file

Infracost estimate: Monthly cost will increase by $0.16 ↑
┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┳━━━━━━━━━━━━━━┳━━━━━━━━━━━━━━━━━━┓
┃ Project                                            ┃ Cost change  ┃ New monthly cost ┃
┣━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━╋━━━━━━━━━━━━━━╋━━━━━━━━━━━━━━━━━━┫
┃ H3rMajesty/Env0/env0_tf_plan.json                  ┃ +$0.16 (+2%) ┃ $9               ┃
┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┻━━━━━━━━━━━━━━┻━━━━━━━━━━━━━━━━━━┛
```
</details>


[Full PR Plan logs on env0](https://app.env0.com/p/bf060c70-8f38-400d-906c-f243d9ffdb03/environments/7571e4bf-f6f2-4ed2-8b7f-94f3cfce5f66/deployments/3ae433d7-dfed-4685-b7dc-aa22a3d56b67)